<?php

namespace Database\Seeders;

use App\Models\Testimonial;
use Illuminate\Database\Seeder;

class TestimonialSeeder extends Seeder
{
    public function run(): void
    {
        if (app()->environment('production')) {
            return;
        }

        $testimonials = [
            [
                'name' => 'NI Rokan',
                'content' => 'সুবহানাল্লাহ! আপনি কি হোসাইন মোহাম্মদ সেলিম নাকি হোসাইন ইবনে আলী (আ.) যে, আবারও শহীদ হতে এসেছেন? জানি না আপনার মনের ভেতর কী আছে? তবে মনে হচ্ছে সত্যের সূর্য উঠবে। স্যালুট আপনাকে।',
                'designation' => 'সাধারণ শুভাকাঙ্ক্ষী',
            ],
            [
                'name' => 'MD Shamsuddin',
                'content' => 'একজন আমাকে প্রশ্ন করেছে, ‘কোথায়, হেযবুত তওহীদ ইসলামিক সংগঠনের লোকজনদেরকে ওয়াজ, মাহফিল, মিলাদ, বিয়ে-শাদি, কবর জিয়ারতে, জানাযা নামাযে তালাশ করে পাই না কেন?’ আপনার ভাষায় এর উত্তর কী? ধর্মব্যব্যবসায়ীরা কিন্তু পাড়ায় পাড়ায় মসজিদ-মাদ্রাসা-ওয়াজ-মাহফিলে জনগণকে বুঝাচ্ছে। আপনারা সজাগ হোন, জনগণকে বুঝান। জনগণ বলছে, তাদের মাথায় ঢুকিয়েছে, তারা (ধর্মব্যবসায়ীরা) খাবে কী? ধর্মব্যবসায়ী হুজুর, কাঠ মোল্লারা সমর্থনে বেশি। তার চাইতে বেশি জনগণ আপনাদের সমর্থনে আছে, কিন্তু ধর্মব্যবসায়ীরা এমন অবস্থা তৈরি করছে যে, জনগণ বুঝার পরও বদমাশদের সাথে তর্ক-বিতর্কে যায় না। আপনাদের যত দ্রুত সম্ভব জনগণকে ভালোভাবে বুঝিয়ে এসব পরিস্থিতি কাটিয়ে উঠতে হবে। নচেৎ সমস্যা আছে, ভাই। আপনাদের ধরা ঠিক আছে। জনগণও এ বিষয়ে ১০০% সহমত। কিন্তু কাঠ মোল্লারা ঐ একটাই কথা সামনে দাঁড় করিয়ে রেখেছে, কাঠ মোল্লারা খাবে কী? জাতিকে বুঝিয়ে তুলুন যত তাড়াতাড়ি সম্ভব।',
                'designation' => 'সাধারণ শুভাকাঙ্ক্ষী',
            ],
            [
                'name' => 'Md Masud Ahmad',
                'content' => 'আপনার প্রোগ্রাম দেখি। আমার অনেক ভালো লাগে।',
                'designation' => 'সাধারণ শুভাকাঙ্ক্ষী',
            ],
            [
                'name' => 'Kabul Sworob',
                'content' => 'আপনার কথাগুলো আমার ভালো লাগে। যুক্তি-বক্তব্য সব আমার ভালো লাগে। আপনার অফিসের নম্বর দিন। আপনার যুক্তি-তর্ক ভালো লাগে।',
                'designation' => 'সাধারণ শুভাকাঙ্ক্ষী',
            ],
            [
                'name' => 'Abdullah Al Masum',
                'content' => 'ভালোবাসি আপনাকে। আপনার কথাগুলোকে।',
                'designation' => 'সাধারণ শুভাকাঙ্ক্ষী',
            ],
            [
                'name' => 'Ha Alinur Rahman',
                'content' => 'আপনার কথাগুলো আমার কাছে খুব ভালো লাগে। আপনার মতো উমর (রা.) কয়েকজনের দরকার ছিল। আপনার নতুন কোনো ভিডিও পাইনি কেন?',
                'designation' => 'সাধারণ শুভাকাঙ্ক্ষী',
            ],
            [
                'name' => 'SI Sabuj R',
                'content' => 'ভাইয়া, আমার প্রথম অনুরোধ হলো হেযবুত তওহীদকে আরও প্রসারিত করার লক্ষ্যে একটি টিভি চ্যানেল খোলা খুবই জরুরী। দ্বিতীয়ত: সারাদেশে ২ লাখ ৮০ হাজার মসজিদের ইমাম-মুয়াজ্জিনকে নিয়ে সভা-সেমিনার করুন। সারাদেশেের ৭টি বিভাগীয় শহরে একটি করে মোট ৭টি সভা করুন। তাদের সম্মুখে আপনি হেযবুত তওহীদের মূল আদর্শ, লক্ষ্য, উদ্দেশ্য তুলে ধরুন। দেখবেন, এই ইমাম-মুয়াজ্জিনগণের মাধ্যমেই সমাজে হেযবুত তওহীদের এক শক্তিশালী দুর্গ গড়ে উঠবে, পাশাপাশি মোল্লারা হেযবুত তওহীদকে নিয়ে যেসব গুজব ছড়িয়েছে, তা সমাজ থেকে বিতাড়িত হবে। প্রতি বছর যদি এভাবে ইমাম-মুয়াজ্জিনদের নিয়ে সভা-সেমিনার করতে পারেন, তাহলে হেযবুত তওহীদ হয়ে উঠবে অতীতের যে কোনো সময়ের চেয়ে আরও অধিক শক্তিশালী এবং অবস্থান করবে দেশের সবচেয়ে জনপ্রিয় ইসলামিক সংগঠন হিসেবে।',
                'designation' => 'সাধারণ শুভাকাঙ্ক্ষী',
            ],
            [
                'name' => 'Ramiz Mullick',
                'content' => 'আসসালামু আলাইকুম, ভাই। আমি একজন ইন্ডিয়ান বুক সেলার। আমি আপনার বইগুলো কিনতে চাই। বইগুলোর ইন্ডিয়ায় চাহিদা আছে। আমার Whats app no: ৮৫******** প্লিজ একটু যোগাযোগ করলে উপকৃত হবো। ফাহিল্লাহিল হামদ।',
                'designation' => 'বই বিক্রেতা (ভারত)',
            ],
            [
                'name' => 'Md Habib Gazi',
                'content' => 'আমি আপনার অনুষ্ঠান দেখেছিলাম। আপনার কথাগুলো আমার খুব ভালো লেগেছিল। ‘দৈনিক বজ্রশক্তির চতুর্থ জন্মবার্ষিকী উপলক্ষ্যে শিশু একাডেমীতে আপনার ওই অনুষ্ঠান হয়েছিল। কেমন আছেন আপনি?',
                'designation' => 'সাধারণ শুভাকাঙ্ক্ষী',
            ],
            [
                'name' => 'Md Shamsuddin (2)',
                'content' => 'আপনার ভিডিওগুলো আমি আমার আইডিতে পোস্ট করেছি, দেখলেন। এই পর্যন্ত আমি অনেক মানুষের সাথে আলোচনা করেছি। আপনাদের কথা বলেছি। তারা বলছে, মানুষ আস্তে আস্তে সচেতন হচ্ছে। আপনারা প্রতিটি ক্ষেত্রে মানুষদের জানিয়ে-বুঝিয়ে, গুছিয়ে তুলুন।',
                'designation' => 'সাধারণ শুভাকাঙ্ক্ষী',
            ],
            [
                'name' => 'মোহাম্মদ জাফর ছিদ্দিকী',
                'content' => 'জনাব, আমি আল্লাহর জন্য আপনাকে ভালোবাসি। আপনার সকল ভিডিও দেখে আমি মুগ্ধ।',
                'designation' => 'সাধারণ শুভাকাঙ্ক্ষী',
            ],
            [
                'name' => 'Mostofa Kamal Jewel',
                'content' => 'ভাই, কেন্দ্রীয় সম্মেলন নিয়ে আর কী বলবো? জানুয়ারীর ৩ তারিখে আপনাকে একটি বার্তা দিয়েছিলাম, সেটি ছিল শিক্ষা আর মিডিয়া। দেখুন, মাদ্রাসার ছাত্ররা এক প্রকার শিক্ষাব্যবস্থার মধ্যে আছে। তাই তারা মিডিয়ার কারণে আপনাদের সামনে জড় হতে যাচ্ছিল। অতএব শিক্ষায় প্রভাবিত মানুষ (হোক মাদ্রাসা শিক্ষা, জেনারেল শিক্ষা বা অন্য কোনো শিক্ষা) আর মিডিয়াকে সংশোধনের জন্য মাঠ পর্যায়ে সতর্কতার সাথে কাজ করতে হবে। এর জন্য প্রচুর মেধাশক্তি, সাহস আর অর্থের প্রয়োজন। আপনার সাথে সরাসরি আলোচনার বসতে চাই। ধন্যবাদ।',
                'designation' => 'সাধারণ শুভাকাঙ্ক্ষী',
            ],
            [
                'name' => 'Sobuz',
                'content' => 'মাননীয় এমাম, সালামু আলাইকুম। আমি কোথায় বেধে আছি ঠিক বুঝতে পারছি না। তবে ভাবতে শুরু করেছি, কেন এখনও আপনার কাছে চলে যেতে পারলাম না। বাধা কোথায়? মাননীয় এমাম, আল্লাহর তওহীদ জয় করার সংগ্রাম করার জন্যই পৃথিবীতে এসেছি। এ কথা আপনাকে জানালাম। সহজ-সরলকে বেঁধে রেখেছি অন্তরে আপনার সাথে একসাথে এ সংগ্রাম করবো বলে। আমি জানি, আর সময় নেই। অন্তর বলে, এখনই সঠিক সময়। ইতোমধ্যে অনেক চিন্তাার মধ্যে একটি চিন্তা বেশি কাজ করে। কোনো কাজ করতে গেলে তার আগে আমি নিজেকে মনে মনে বলি, এ কাজের জয় আমার চাই। কারণ আমি জানি, এ কাজ আল্লাহর কাজ। তাঁর উর্ধ্বে কেউ হতে পারে না। মাননীয় এমাম, আপনি আমাকে একটু বুঝে কিছু বলুন। আপনার ভাষা দিয়ে আমার মনটাকে ধুয়ে দিন। আপনি লিখলেই আমার মেধা স্বস্তি পাবে, জীবনের গতি বেড়ে যাবে। অনেক কিছু আপনাকে দেয়ার আছে, যা আল্লাহ চান। এগুলো আমাকে দিতে হবে ইনশাল্লাহ। আমার যা কিছু সহজ-সরলতা আছে, আমি আপনাকে দিতে চাই।',
                'designation' => 'সাধারণ শুভাকাঙ্ক্ষী',
            ],
            [
                'name' => 'Kazi Tahamina Begum',
                'content' => 'আসসালামু আলাইকুম। আপনার দেয়া প্রতিটি বক্তব্য সত্য ও সুন্দর। এর মধ্যে কেউ ভুল ধরতে পারবে না। সব বক ধার্মিক জানে আপনি সত্য ও ন্যায়ের পথে এগিয়ে যাচ্ছেন। কিন্তু তাদের প্রকাশ করতে এত কষ্ট কেন বুঝতে পারলাম না। আমি আল্লাহর কাছে দোয়া করি আপনার এ সংগ্রাম যেন বিশ্বময় সফল হয়। (যার নামের আগে আল্লামা-শফি। তিনিও টাকা চোর। তেঁতুল হুজুর।) এরাই আমাদের পবিত্র ধর্ম ইসলামের ঠাকুর। ধর্ম নিয়ে কী তাদের অহংকার! শয়তানের মতো হুংকার দিয়ে কথা বলে। এদের কুকীর্তির কথা বলে শেষ করা যাবে না। অনেক ভালো থাকুন, সাবধানে থাকুন। আল্লাহ আপনার হেফাজত করুক। শুভ কামনা রইলো আপনার জন্য। আমি অত্যন্ত গর্বিত যে আপনার মাধ্যমে ইসলামের সঠিক পথের সন্ধান পেয়েছি। আজ পর্যন্ত কোনো মোল্লার কথাই আমার সঠিক বলে মনে হয়নি। তারা সব কথাই শুধু পেঁচিয়ে বলে, ইসলামকে অনেক কঠিন বানিয়ে ফেলে। আপনার মতো এতো সহজ করে কেউ কোনোদিন বলেনি। আপনার জয় হবে, ইনশাল্লাহ। আল্লাহ আপনার ভালো করুন।',
                'designation' => 'সাধারণ শুভাকাঙ্ক্ষী',
            ],
            [
                'name' => 'MD Jahidul Islam S',
                'content' => 'আমি কি আপনাদের সাথে Add হতে পারি? আমি আপনাদের দলভুক্ত হতে পারি?',
                'designation' => 'সাধারণ শুভাকাঙ্ক্ষী',
            ],
            [
                'name' => 'Omar Faruk Emon',
                'content' => 'স্যার, আমার বাড়ি কক্সবাজার। আমি ফোনে তাঁর (মাননীয় এমামের) সাথে কথা বলবো। যদি সম্ভব হয় তবে চট্টগ্রাম গিয়ে তাঁর সাথে সাক্ষাৎ করবো, ইনশাল্লাহ। ঢাকায় গেলে অবশ্যই আপনাদের সাথে সাক্ষাৎ করবো, ইনশাল্লাহ।',
                'designation' => 'সাধারণ শুভাকাঙ্ক্ষী',
            ],
            [
                'name' => 'Anonymous Testimonial',
                'content' => 'নারী দিবস নিয়ে খুব ভালো কথা বলেছেন। ধন্যবাদ, ভাইয়া। আসলে আমি বলতে চাচ্ছিলাম যে, এত মানুষ থাকতে মুসলমানদের নিয়ে আপনার মাথাব্যথা (চিন্তা) কেন? অনেক মানুষ আপনার বিরোধিতা করে। তবুও আপনি কাজ চালিয়ে যাচ্ছেন। আপনার অনেক বক্তব্যই শুনলাম, অনেক ভালো লেগেছে।',
                'designation' => 'সাধারণ শুভাকাঙ্ক্ষী',
            ],
            [
                'name' => 'MD. Mujibur Rahman',
                'content' => 'সালাম নিবেন, ভাই। আমি আপনার সকল প্রোগ্রাম শুনি। আপনার সাথে সহমত। ইসলাম মানে মারামারি, কাটাকাটি, হিংসা, নিন্দা নয়। ইসলাম মানে শান্তি ও অন্যায়ের বিরুদ্ধে প্রতিবাদ করা। মানবজাতিকে সঠিক দিক-নির্দেশনা দেয়া। কোনটা ভালো, কোনটা খারাপ; তা মানুষকে বুঝিয়ে দেয়া। ইসলাম সব ধর্মের সর্বশ্রেষ্ঠ ধর্ম। কিন্তু কিছু স্বার্থ হাসিলকামী লোকেরা আমাদের এই ইসলাম ধর্মটাকে কলুষিত করে রেখেছে। নিজের ফায়দার জন্য তারা ইসলামের প্রকাশকে অন্যভাবে তুলে ধরছে। ইনশাল্লাহ সত্যের জয় হবেই হবে। আল্লাহ আপনাকে এই মহান কাজ চালিয়ে যাওয়ার তওফিক দিক। আমি একজন সাধারণ মানব। সত্যের পথে মরতেও দ্বিধা করি না। দোয়া রইলো আপনার জন্য।',
                'designation' => 'সাধারণ শুভাকাঙ্ক্ষী',
            ],
            [
                'name' => 'Joydeb Ganguly',
                'content' => 'আমি খুবই চিন্তিত। আপনার মতো একজন শিক্ষিত, মানবতাবাদী, সত্য, অকপট বক্তাকে হারিয়ে ফেললাম কিনা। দিনে দিনে আপনার মতো মানুষরা এই পৃথিবীতে লাঞ্ছিত ও অপমানিত হচ্ছে। আমরা সবাই ধর্মের নামে অধর্মের বেড়াজালে এমনভাবে আটকে পড়েছি যে, কেউই জোর গলায় আসল সত্যকে বলতে পারছি না। এই পৃথিবীতেই স্বর্গ ও নরক বিদ্যমান। নির্মল আনন্দ ভোগ করা হলো স্বর্গ। যা মানুষকে মলিন করে, তা-ই নরক। আমি খুব শঙ্কিত আপনাদের দেশের ফতোয়ার বহর দেখে। আমাদের দেশেও গোড়া হিন্দু আছে, কিন্তু তারা ওই রকম জেহাদী জল্লাদ নয়। সত্যি, সৃষ্টিকর্তা আপনাকে বিশেষ শক্তি প্রদান করেছেন। আপনার হৃদয়ে তিনি যে আগুন দিয়েছেন, তার ফলে আপনি ওই পরিস্থিতিতে লড়তে পারছেন। কামনা করি ও প্রার্থনা করি সর্বশক্তিমানের কাছে, তিনি আপনাকে ভালো রাখুন, নিরাপদে রাখুন।',
                'designation' => 'সাধারণ শুভাকাঙ্ক্ষী',
            ],
            [
                'name' => 'Alamgir Hossain',
                'content' => 'আপনার বক্তব্য শুনলাম। বেশ ভালো লাগলো। সুন্দর যুক্তি ও উপস্থাপনা। আপনাকে বলেছিলাম, কিছু কৌশল অবলম্বন করুন। আপনি ধর্মব্যবসায়ীদের এত তাড়াতাড়ি বা রাতারাতি মোকাবেলা করতে পারবেন না। দেখুন, তাদের কোনো কাজকর্ম নেই। ধর্মব্যবসাটাই তাদের বেঁচের থাকার প্রধান অবলম্বন। জীবন দিয়ে বা জীবন নিয়ে হলেও তারা সেটা রক্ষা করবে। তাদের সাথে হুটহাট করে কিছুই করা যাবে না। তারা বেশির ভাগই মূর্খ। আর মূর্খদের একবার আবেগী জোরে তুলতে পারলে তাদের দ্বারা সবকিছুই করানো সম্ভব। নিরাশ বা হতাশ কোনোটাই হওয়ার দরকার নেই। সৎ পথে থাকলে আল্লাহ সহায় হবেন। সমাবেশ স্থগিত করে বেশ ভালোই করেছেন। রক্তপাত এড়িয়ে যাওয়ার জন্য ধন্যবাদ আপনাকে। বাস্তবতা অত্যন্ত কঠিন ঐ ভণ্ডের দলও সেটা জানে। তাই দেখতে পাবেন একজন আরেকজনের গীবত করে গোষ্ঠী উদ্ধার করে, আবার ক্ষণেক ক্ষণেক প্রশংসায় পঞ্চমুখও হয়। বলে, ‘আমাদের মধ্যে মতবিরোধ থাকতে পারে কিন্তু ইসলামের দুশমনদের ক্ষেত্রে আমরা সবাই এক।’ লোকদের প্রশ্ন করে, ‘বলেন ঠিক কিনা?’; উপস্থিত মূর্খের দল অমনি চিৎকার করে বলে ‘ঠিক। নারায়ে তাকবীর। আল্লাহু আকবার।’ আসলে তারা জানেই না কোনটা ঠিক আর কোনটা বেঠিক। আর যদি আস্তে জবাব দেয় তবে বলে, ‘এই কথা কন না কেন? কথা বলেন। জোরে বলেন। আরও জোরে বলেন। আমার সাথে চিল্লিয়ে বলেন। আল্লাহু আকবার!’ কত রকম কৌশল যে তারা জানে, আপনিও জানেন না। তারা জানে, তারা যা বলছে তা কোরআন-হাদিস বহির্ভূত এবং তাদের নিজস্ব আবির্ভূত কথা। ফেরাউনের মতো সবাই জানে, আল্লাহ আছেন। আল্লাহ সবকিছুর মালিক। কিন্তু আমি যে জনগণের প্রভু সেটা বজায় থাকবেই। পরে আল্লাহ যা করার করবে। আল্লাহর কাছে ক্ষমা চেয়ে নেবো। তারা কোনোদিনই জীবন থাকতে সত্য প্রকাশ করতে দিবে না। কারণ সত্য প্রকাশ পেলেই সব জাড়িজুড়ি শেষ। তারা সেটা ভালো করেই জানে। তাই যে সত্য প্রকাশের চেষ্টা করবে, তাকে তারা কাফের, মোনাফেক, মুরতাদ, নাস্তিক, বেইমান, দালাল, দুশমন, শয়তান, জাহান্নামী আরও কত কী উপাধি দেবে! তারা নিজেরাই নিজেদেরকে এরকম উপাধি দিয়েও থাকে নিজেদের স্বার্থে। তাতে কী লাভ হয় জানেন? তাদের জনপ্রিয়তা বৃদ্ধি পায়। রিক্সা থেকে বেবি, মাইক্রোবাস; তারপর এখন বর্তমানে হেলিকপ্টারের প্রতিযোগীতা শুরু হয়েছে। এরা মূলত এক শ্রেণির দালাল পোষে। ঐ সমস্ত দালালরাই এদের জনপ্রিয়তা আকাশে তুলে দেয়। তাই আপনাকে কিছুটা হলেও যুগের সাথে, পরিবেশ পরিস্থিতির সাথে তাল মিলিয়ে চলতে হবে। এটা আমার পরামর্শ। কিন্তু লক্ষ্যভ্রষ্ট হওয়া যাবে না। লক্ষ্যটা অবশ্যই স্থির এবং সুনির্দিষ্টই হবে। সময়ে সময়ে তলোয়ার উন্মুক্ত করতে হবে, শান দিতে হবে, আবার প্রয়োজনে খাপেও ভরতে হবে। আপনার কি মনে নেই হুদায়বিয়ার সন্ধি আপাত দৃষ্টিতে মুসলমানের পরাজয় মনে হলেও মূলত সেটা ছিল ‘ফাত হুম মুবিন’ বা মহা বিজয়। যেটা রসুল (স.) কাফেরদের সাথে করতে বাধ্য হয়েছিলেন। আসলে সেটাও ছিল একটা কৌশল। আপনিও এই মূহুর্তে কিছু কাজ এড়িয়ে যান। পরে শক্ত অবস্থানে আসার পরই সেটা করেন। তখন কেউ বাধা দিলেও রোধ করতে পারবে না।',
                'designation' => 'সাধারণ শুভাকাঙ্ক্ষী',
            ],
            [
                'name' => 'Abdul Jabbar',
                'content' => 'আসসালামু আলাইকুম। কেমন আছেন? আমি আপনাকে অনেক ভালোবাসি।',
                'designation' => 'সাধারণ শুভাকাঙ্ক্ষী',
            ],
            [
                'name' => 'Anonymous English Testimonial',
                'content' => 'Surely, I will. We are really far away from Islam. Knowledge doesn’t require any education. It comes from within if one learns from nature. Nature has got answer to all the questions as may be posed by any human being. I passed SSC in 1987 and studied law at University of Dhaka. I did my LL.M from New York State University. The reason mentioned about my education is to convey you the message that my academic education didn’t help me a bit to understand my life, but pure nature did. I hope you stay fine with all the members of your organization. My best wishes to your endeavor to cultivate and spread the real message of Islam to the mankind. Stay fine.',
                'designation' => 'সাধারণ শুভাকাঙ্ক্ষী',
            ],
            [
                'name' => 'Md Bappy Hossain',
                'content' => 'Sir, I have read your excellent, amazing book “Dhormobybshar Faande”... This one is the best one for knowing about fake Olamay-e-kerum. You are really doing your great job. Allah bless you. This nation people will understand your book message after 20 years properly. Just wait for your best time for spreading pure message of Islam. Don’t give up, man!',
                'designation' => 'সাধারণ শুভাকাঙ্ক্ষী',
            ],
        ];

        foreach ($testimonials as $index => $t) {
            Testimonial::updateOrCreate(
                ['name' => $t['name']],
                [
                    'content' => $t['content'],
                    'designation' => $t['designation'],
                    'rating' => 5,
                    'is_active' => true,
                    'sort_order' => $index + 1,
                ]
            );
        }
    }
}